; domain
(define (domain crash-d)
    (:requirements :adl)

    (:types
        car lane altitude direction - object
    )

    (:constants
        agent - car
        left straight right - direction
    )

    (:predicates
        (equal ?C1 - car ?C2 - car)
        (hasPos ?C - car ?L - lane ?A - altitude)
        (hasDir ?C - car ?D - direction)
        (nextX ?D - direction ?L1 - lane ?L2 - lane)
        (nextY ?A1 - altitude ?A2 - altitude)
        (hasCrashed ?C1 - car)
        (updated)
    )

    (:action setDirection
        :parameters (?D1 - direction)
        :precondition (updated)
        :effect (and
            (not (hasDir agent left))
            (not (hasDir agent straight))
            (not (hasDir agent right))
            (hasDir agent ?D1))
    )

    (:action setStop
        :parameters ()
        :precondition (updated)
        :effect (and
            (not (hasDir agent left))
            (not (hasDir agent straight))
            (not (hasDir agent right)))
    )

    (:action update
        :parameters ()
        :precondition (not (updated))
        :effect (and
            (updated)
            (forall
                (?C1 - car ?C2 - car ?A1 - altitude ?L1 - lane)
                (when
                    (and
                        (not (equal ?C1 ?C2))
                        (not (hasCrashed ?C1))
                        (hasPos ?C1 ?L1 ?A1)
                        (hasPos ?C2 ?L1 ?A1))
                    (and
                        (hasCrashed ?C1)
                        (hasCrashed ?C2)
                    ))))
    )

    (:action go
        :parameters ()
        :precondition (updated)
        :effect (and
            (not (updated))
            (forall
                (?C1 - car ?D1 - direction ?A1 - altitude ?A2 - altitude ?L1 - lane ?L2 - lane)
                (when
                    (and
                        (not (hasCrashed ?C1))
                        (hasPos ?C1 ?L1 ?A1)
                        (hasDir ?C1 ?D1)
                        (nextX ?D1 ?L1 ?L2)
                        (nextY ?A1 ?A2))
                    (and
                        (not (hasPos ?C1 ?L1 ?A1))
                        (hasPos ?C1 ?L2 ?A2))))
        )
    )
)

; problem
(define (problem crash-p-01)
    (:domain crash-d)
    (:objects
        c1 c2 - car
        l1 l2 - lane
        a1 a2 a3 a4 - altitude
    )
    (:init
        (updated)

        (equal agent agent)
        (equal c1 c1)
        (equal c2 c2)

        (hasPos agent l1 a1)
        (hasPos c1 l2 a1)
        (hasPos c2 l2 a3)

        (hasDir agent straight)
        (hasDir c1 straight)
        ; (hasDir c2 straight)

        (nextX straight l1 l1)
        (nextX straight l2 l2)
        (nextX right l1 l2)
        (nextX right l2 l2)
        (nextX left l1 l1)
        (nextX left l2 l1)

        (nextY a1 a2)
        (nextY a2 a3)
        (nextY a3 a4)
        (nextY a4 a4)
    )

    (:goal
        (and (hasPos agent l2 a4)
            (not (hasCrashed agent)))
    )
)

; plan
1. (go)
   deleted: (updated) (haspos agent l1 a1) (haspos c1 l2 a1)
   added: (haspos agent l1 a2) (haspos c1 l2 a2)
   goals met: 1 of 2
2. (update)
   added: (updated)
   goals met: 1 of 2
3. (go)
   deleted: (updated) (haspos agent l1 a2) (haspos c1 l2 a2)
   added: (haspos agent l1 a3) (haspos c1 l2 a3)
   goals met: 1 of 2
4. (update)
   added: (updated) (hascrashed c1) (hascrashed c2)
   goals met: 1 of 2
5. (setdirection right)
   deleted: (hasdir agent straight)
   added: (hasdir agent right)
   goals met: 1 of 2
6. (go)
   deleted: (updated) (haspos agent l1 a3)
   added: (haspos agent l2 a4)
   goals met: 2 of 2
